[
  {
    "body": {
      "0": "<p>Our bootcamps teach full-stack architecture using JavaScript, including SQL and React. You can find our curriculum <a href=\"/our-courses/coding-bootcamp\"><strong>here</strong></a>.</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/faqs/",
      "time": "2023-05-12 12:25:36.371770"
    }
  },
  {
    "body": {
      "0": "<p>Whilst at Northcoders I spent pretty much all day, every day, learning about programming. Most of this time was spent getting to grips with JavaScript (Node and Express on the backend, followed by a front-end introduction to React). We covered lots more than this though: databases (SQL and NoSQL); testing our code to make sure it was robust; learning about (and using) loads of different libraries and APIs. It was challenging and stressful at times but enjoyable with it. Friday beers too - nearly forgot that!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/resources/testimonials/andy-hun/",
      "time": "2023-05-12 12:25:46.361843"
    }
  },
  {
    "body": {
      "0": "<p>The team comprised a Senior Developer (a Northcoders Senior Tutor, Paul Copley in our case), and 4 Northcoders graduates. Another caveat : we were all trained in the same way, using the same tools, techniques, processes, language (JS), database (PostgreSQL) etc, so getting started was quick.</p>",
      "1": "<p><strong>Typing</strong> : Typescript we did not use. Some 3rd party-libraries were written in Typescript. We did use hapi/joi to define the permitted shape of JS objects flowing into PostgreSQL.</p>",
      "2": "<li>NoSQL</li>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/in-depth-with-the-idol-my-first-dev-role-after-northcoders/",
      "time": "2023-05-12 12:25:54.313281"
    }
  },
  {
    "body": {
      "0": "<p>Then I moved onto my list. First up: React Native. I followed a tutorial to build a simple app – not only did I get to use React Hooks, but at the end I also had something I could put on my portfolio site. I then used the learning from this to build the first project on my list: an app that serves quotes that are personal to me, collected over a period of 10 years. Bonus skill points: data is served from a REST API, giving me the opportunity to refresh my PostgreSQL and Express skills.</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/on-finding-work-during-lockdown/",
      "time": "2023-05-12 12:25:54.733896"
    }
  },
  {
    "body": {
      "0": "<h2>Databases and SQL</h2>",
      "1": "<p>We learn SQL from <a href=\"https://sqlbolt.com/\">SQLBolt</a>. It is a language used for creating and managing data held in a (relational) database. \"What? Learning another language?\" Yes. But it is actually fairly simple (at least at this stage). We also get introduced to Postgres which is a database management system and works pretty well with Node.js. We learn to use <a href=\"http://knexjs.org/\">Knex.js</a> which is an <a href=\"https://www.npmjs.com/\">npm package</a> to make our lives easier. We can now create databases and tables in those databases, and <em>seed</em> them (fill them) with data.</p>",
      "2": "<a href=\"https://sqlbolt.com/\">SQLBolt</a>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/but-what-on-earth-is-a-server-and-what-is-api/",
      "time": "2023-05-12 12:25:54.853666"
    }
  },
  {
    "body": {
      "0": "<li>KATALYST is a web-based application that will help NC students more accurately track their progress throughout the course, using React, SQL and the Slack API. </li>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/cohort-7-have-graduated-/",
      "time": "2023-05-12 12:26:00.673611"
    }
  },
  {
    "body": {
      "0": "<p>Don't write anything down that might catch you out at interview. You need to be able to demonstrate you're at least somewhat knowledgeable about that particular langauge, framework, library, database or whatever it might be. If you say you know SQL, but can't tell them how you'd update a record, you'll be in trouble!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/writing-the-perfect-junior-developer-cv/",
      "time": "2023-05-12 12:26:01.186260"
    }
  },
  {
    "body": {
      "0": "<li>On the back-end, we teach Node, MongoDB, Express and PostgreSQL. We even introduce them to Serverless.</li>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/8-reasons-why-you-should-you-hire-a-northcoder/",
      "time": "2023-05-12 12:26:01.205625"
    }
  },
  {
    "body": {
      "0": "<p>We've been teaching our students Javascript and SQL for over a year - now it's time to add the third and final of the top three programming languages to our curriculum!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/highly-employable-skills-northcoders-launches-java-offering/",
      "time": "2023-05-12 12:26:02.220597"
    }
  },
  {
    "body": {
      "0": "<p>JavaScript is the only language that can be run both on the front and back end. Once you’ve mastered the fundamentals of coding in JavaScript, we show you how we can use use Node.js to run code for the back end, and focus on ways of dealing with asynchronous programming. We'll look at APIs and databases, and cover Express and SQL. We’ll also work with some pretty cool third-party data sets and APIs, and help you deploy applications to the cloud!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/our-courses/remote-coding-bootcamp/",
      "time": "2023-05-12 12:26:08.331087"
    }
  },
  {
    "body": {
      "0": "<p>Week 8 kicks off with two days focused on SQL advanced queries. The rest of the week develops data architecture patterns. We begin to understand what a Data Warehouse is (tables of data optimised for analysis) and how that is different from a “Data Lake” (many files) and a “Data Lakehouse” (a combination between a Data Warehouse and a Data Lake). We apply this theory by looking into how to “normalise” data and how to ingest, clean and prepare data to be stored in a data warehouse. This is part of the so-called ETL pattern, extract — transform — load (capture and prepare the data; make them available for analysis). Week 8 also sets the scene for one of the most intense learning experiences which happen in week 9: how to deploy a lambda function on Amazon Web Services (AWS).</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/the-first-cohort-of-data-engineering-bootcamp-at-northcoders/",
      "time": "2023-05-12 12:26:08.923163"
    }
  },
  {
    "body": {
      "0": "<li><a target=\"_blank\" rel=\"noopener\" href=\"https://www.npmjs.com/package/pg\"><strong>node-postgres</strong></a> to query PostgreSQL data from within an express server.</li>",
      "1": "<li>Identifying PSQL errors and creating custom errors.</li>",
      "2": "<li>Connect to different PostgreSQL databases programmatically.</li>",
      "3": "<li>SQL injection and handling it with <a target=\"_blank\" rel=\"noopener\" href=\"https://www.npmjs.com/package/pg-format\"><strong>pg-format</strong></a>.</li>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/my-coding-bootcamp-odyssey---week-6/",
      "time": "2023-05-12 12:26:09.166448"
    }
  },
  {
    "body": {
      "0": "<li>Program a database (for example SQL or SQLite)<br></li>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/coding-jargon-explained---a-beginners-guide/",
      "time": "2023-05-12 12:26:09.379381"
    }
  },
  {
    "body": {
      "0": "<p>Focusing on your strengths in relation to the role you’re applying for can be the best thing you can do for yourself. For example, if you have limited experience with SQL but have listed it as a skill, then be aware that this is a topic you could easily be asked about - Write more about the things you know and feel more confident in talking about, and making sure you’re applying for those roles that play into your strengths rather than your weaknesses. It’s certainly something you can discuss with an employer on the tail end of an interview, you never know what some employers might do for you in regards to extra training or upskilling even after graduating from Northcoders.<br><br></p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/writing-a-cv-for-your-first-tech-job/",
      "time": "2023-05-12 12:26:10.412391"
    }
  },
  {
    "body": {
      "0": "<p>I knew this involved databases and as I had dabbled with SQL many years ago, and as had plenty of data analytical experience, I started the year eager to learn and crack on with my coding journey.</p>",
      "1": "<p>The final day, was an introduction to SQL and fortunately, some of this was already in my long term memory from a previous lifetime. This was followed by a quick introduction to our careers team - I am here to get a job after all so great to start thinking about what comes next after our Bootcamp.</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/passed-the-halfway-mark-on-my-coding-bootcamp-journey/",
      "time": "2023-05-12 12:26:11.553744"
    }
  },
  {
    "body": {
      "0": "<p>PHOTO: Our final sprint of the week where we had to setup our environment and create our database + test database using PostgreSQL, make the connections, access the raw data and create a lookup method, create controllers and models for specific endpoints, and test, test, test! TDD for the win!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/coding-bootcamp-week-613-second-week-on-back-end/",
      "time": "2023-05-12 12:26:11.693585"
    }
  },
  {
    "body": {
      "0": "<li><strong>Database Management Systems</strong><br>Data engineers must be able to work with database management systems like MySQL and Oracle. Our Data Fundamentals module covers advanced SQL syntax, accessing Postgres databases with Python, data modeling, and common data architecture patterns. You will also participate in sprints focused on SQL syntax, practical modeling tasks, and Python.<br><br></li>"
    },
    "meta": {
      "url": "https://northcoders.com/company/blog/8-essential-skills-every-data-engineer-must-have/",
      "time": "2023-05-12 12:26:12.782994"
    }
  },
  {
    "body": {
      "0": "<p>The Northcoders x KPMG course curriculum built their confidence with JavaScript laying the foundations for them to be able to handle data and create interactive websites and apps, utilising their newly found semantic HTML and responsive CSS skills. It then moved on to give them an understanding of test-driven and object-oriented development, using Node.js to run code for the back end, and focus on dealing with asynchronous programming as well as APIs, databases and SQL and CloudOps.<br><br>The latter part of the onboarding academy then moved into UX design and React, the most in-demand front-end frameworks, which they used to create entire complex front-ends for their website and app projects. The final project phase consolidated all that they had learned and saw groups work together to create a completed app which they showcased at their graduation.<br><br>Amul Batra – chief operating officer at Northcoders – said: “We were delighted to work with KPMG as their onboarding partner and help them achieve both their people development and business goals. The firm’s Technology Engineering Graduate Programme is a truly innovative scheme that is all about helping the best people build lasting careers in the tech sector. That aligns perfectly with we what we are trying to achieve as business. We are really looking forward to now seeing the KPMG x Northcoders cohort flourish as they forge ahead in their chosen specialisms.”</p>"
    },
    "meta": {
      "url": "https://northcoders.com/press-and-media/kpmgs-technology-engineering-grads-celebrate-after/",
      "time": "2023-05-12 12:26:15.111970"
    }
  },
  {
    "body": {
      "0": "<p>JavaScript is the only language that can be run both on the front and back end. Once you’ve mastered the fundamentals of coding in JavaScript, we show you how we can use use Node.js to run code for the back end, and focus on ways of dealing with asynchronous programming. We'll look at APIs and databases, and cover Express and SQL. We’ll also work with some pretty cool third-party data sets and APIs, and help you deploy applications to the cloud!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/our-courses/skills-bootcamp-in-coding/",
      "time": "2023-05-12 12:26:15.632111"
    }
  },
  {
    "body": {
      "0": "<p>JavaScript is the only language that can be run both on the front and back end. Once you’ve mastered the fundamentals of coding in JavaScript, we show you how we can use use Node.js to run code for the back end, and focus on ways of dealing with asynchronous programming. We'll look at APIs and databases, and cover Express and SQL.</p>"
    },
    "meta": {
      "url": "https://northcoders.com/our-courses/cloud-engineering-bootcamp/",
      "time": "2023-05-12 12:26:15.684531"
    }
  },
  {
    "body": {
      "0": "<p>You’ll learn JavaScript, Python, PSQL and the fundamentals of Cloud - so you’ll be ready to hit the ground running in your first role</p>",
      "1": "<p class=\"h6\">SQL and Data Modelling</p>",
      "2": "<p>JavaScript is the only language that can be run both on the front and back end. Once you’ve mastered the fundamentals of coding in JavaScript, we show you how we can use use Node.js to run code for the back end, and focus on ways of dealing with asynchronous programming. We'll look at APIs and databases, and cover Express and SQL.</p>",
      "3": "<p class=\"h4 mb-4\">SQL and Data Modelling</p>",
      "4": "<p>Using SQL we will learn how to turn raw data into easy-to-consume data sets. Data Models ensure consistency in naming conventions, default values, semantics, and security, as well as optimising performance and data quality. We'll start to learn the fundamentals of data warehousing and how to deal with different file data formats like JSON, XML and Parquet.</p>"
    },
    "meta": {
      "url": "https://northcoders.com/our-courses/data-engineering-bootcamp/",
      "time": "2023-05-12 12:26:15.842406"
    }
  },
  {
    "body": {
      "0": "<p>JavaScript is the only language that can be run both on the front and back end. Once you’ve mastered the fundamentals of coding in JavaScript, we show you how we can use use Node.js to run code for the back end, and focus on ways of dealing with asynchronous programming. We'll look at APIs and databases, and cover Express and SQL. We’ll also work with some pretty cool third-party data sets and APIs, and help you deploy applications to the cloud!</p>"
    },
    "meta": {
      "url": "https://northcoders.com/our-courses/coding-bootcamp/",
      "time": "2023-05-12 12:26:15.940057"
    }
  }
]
